# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Binaries
brew "awscli"
brew "bash-completion"
brew "bash"
brew "coreutils"
brew "curl"
brew "deno"
brew "git-lfs"
brew "kubectl"
brew "mas" # Mac App Store Manager
brew "minikube"
brew "nvm" # Node Version Manager
brew "postgresql"
brew "tree"
brew "yarn"

# Password manager
cask "keepassx"

# Browsers
cask "firefox"
cask "google-chrome"

# Editor
cask "visual-studio-code"

# Design
cask "figma"

# Utilities
cask "appcleaner"
cask "caffeine"
cask "docker"
cask "iterm2"
cask "recordit"
cask "robo-3t"
cask "spectacle"

# extends quicklook so it supports more formats
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "webpquicklook"

# Others
cask "skype"
cask "slack"
cask "vlc"
cask "whatsapp"
