# Taps
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"

# Binaries
brew "awscli"
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "curl"
brew "jpeg", args: ["universal"]
brew "mas" # Mac App Store Manager
brew "nvm" # Node Version Manager
brew "tree"
brew "yarn"

# Password manager
cask "keepassx"

# Browsers
cask "google-chrome"
cask "firefox"

# Editor
cask "visual-studio-code"

# Design
cask "figma"

# Utilities
cask "appcleaner"
cask "caffeine"
cask "recordit"
cask "spectacle"
mas "The Unarchiver", id: 425424353

# extends quicklook so it supports more formats
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'
cask 'qlprettypatch'
cask 'betterzipql'

# Others
cask "whatsapp"
cask "skype"
cask "vlc"
