# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "schappim/ocr"

# Binaries
brew "awscli"
brew "bash-completion"
brew "bash"
brew "bat"
brew "bottom"
brew "coreutils"
brew "curl"
brew "fd"
brew "git-delta"
brew "git-lfs"
brew "mas" # Mac App Store Manager
brew "nvm" # Node Version Manager
brew "pnpm"
brew "postgresql"
brew "schappim/ocr/ocr"
brew "starship"
brew "tree"
brew "yarn"

# Browsers
cask "firefox"
cask "google-chrome"

# Editors
cask "cursor"
cask "obsidian"
cask "visual-studio-code"

# Tools
cask "docker"
cask "ghostty"
cask "postman"

# Design
cask "figma"

# Utilities
cask "appcleaner"
cask "caffeine"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "gh"
cask "pdfsam-basic"
cask "rectangle"
cask "responsively"

# Quicklook extensions (MacOS preview)
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "quicklook-csv"
cask "quicklook-json"
cask "webpquicklook"

# Music
cask "yt-music"

# Communication
cask "slack"
cask "whatsapp"
cask "zoom"
